cf=-110000;%侧偏刚度根据曲线估算
cr=cf;%严格来说 CR 和 CF 应该不一样，但差别不大，所以近似认为一样
m=1412;%根据Carsim把整车参数输进去
Iz=1536.7;
a=1.015;
b=2.910-1.015;
k=zeros(5000,4);%申请矩阵k，用来存放LQR的k
for i=1:5000
    vx=0.01*i;%只有vx是变量，所以每隔0.01米每秒，算一下对应的k。
    %这样的话就可涵盖v从 0.01 米每秒到 v 等于 50 米每秒这么大范围内所有的 k 
    A=[0,1,0,0;
        0,(cf+cr)/(m*vx),-(cf+cr)/m,(a*cf-b*cr)/(m*vx);
        0,0,0,1;
        0,(a*cf-b*cr)/(Iz*vx),-(a*cf-b*cr)/Iz,(a*a*cf+b*b*cr)/(Iz*vx)];
    B=[0;
        -cf/m;
        0;
        -a*cf/Iz];
    Q=1*eye(4);
    R=10;
    k(i,:)=lqr(A,B,Q,R);
end
k1=k(:,1)';%建立四个变量，K1、K2、K3、K4，把表记录下来
k2=k(:,2)';%因为Simlink不能传矩阵，只能传行向量，需要做个转置
k3=k(:,3)';
k4=k(:,4)';
